#include <stdio.h>

// 数组指针定义第一种方式
int main01()
{
	// 数组指针，它是指针，指向一个数组的指针
	// 数组指针，指向一维数组的整个数组，而不是首元素地址
	// 定义数组指针变量

	int a[10] = { 0 };

	// 1.先定义数组类型，根据类型定义指针变量
	typedef int A[10];	// A代表数组类型，[10]代表步长
	A* p = NULL;  // p数组指针类型变量
	//p = a;	// a代表首元素地址，a 和 &a 一样，最终也是当作&a，警告
	p = &a;	// &a代表整个数组首地址

	printf("p:%d, p+1:%d\n", p, p + 1);

	for (int i = 0; i < 10; i++)
	{
		// p = &a;
		// *p = *&a -> a
		// (*p)[i] = a[i]
		(*p)[i] = i + 1;
	}
	for (int i = 0; i < 10; i++)
	{
		printf("%d ", (*p)[i]);
	}
	printf("\n");

	printf("\n");
	return 0;
}


// 数组指针定义第二种方式
int main02()
{
	int a[10] = { 0 };

	// 2.先定义数组指针类型，根据类型定义变量
	// 和指针数组写法很类似，多了()
	// () 和 [] 优先级一样，结合律从左向右
	// ()有指针，它是一个指针
	// []它是指向数组的指针，它有typedef，所以它是一个数组指针类型
	typedef int(*P)[10];	
	P q;  // 数组指针变量
	q = &a;

	for (int i = 0; i < 10; i++)
	{
		(*q)[i] = 2 * i + 1;
	}
	for (int i = 0; i < 10; i++)
	{
		printf("%d ", (*q)[i]);
	}
	printf("\n");


	printf("\n");
	return 0;
}

// 数组指针定义第三种方式
int main()
{
	int a[10] = { 0 };

	// 3.直接定义数组指针变量
	// 和指针数组写法很类似，多了()
	// () 和 [] 优先级一样，结合律从左向右
	// ()有指针，它是一个指针
	// []它是指向数组的指针，没有typedef，所以它是一个数组指针类型变量
	int(*q)[10];  // q数组指针变量
	q = &a;

	for (int i = 0; i < 10; i++)
	{
		(*q)[i] = 3 * i + 1;
	}
	for (int i = 0; i < 10; i++)
	{
		printf("%d ", (*q)[i]);
	}
	printf("\n");


	printf("\n");
	return 0;
}